GreatCowBASIC/DATFileGenerator/incfiles/p18F26Q84.inc
;----- C1FIFOCON1U Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1FIFOCON1T Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
PLSIZE0          EQU  H'0005'
PLSIZE1          EQU  H'0006'
PLSIZE2          EQU  H'0007'


;----- C1FIFOSTA1 Bits -----------------------------------------------------
TFNRFNIF         EQU  H'0000'
TFHRFHIF         EQU  H'0001'
TFERFFIF         EQU  H'0002'
RXOVIF           EQU  H'0003'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1FIFOSTA1H Bits -----------------------------------------------------
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'


;----- C1FIFOUA1 Bits -----------------------------------------------------
FIFOUA0          EQU  H'0000'
FIFOUA1          EQU  H'0001'
FIFOUA2          EQU  H'0002'
FIFOUA3          EQU  H'0003'
FIFOUA4          EQU  H'0004'
FIFOUA5          EQU  H'0005'
FIFOUA6          EQU  H'0006'
FIFOUA7          EQU  H'0007'


;----- C1FIFOUA1H Bits -----------------------------------------------------
FIFOUA8          EQU  H'0000'
FIFOUA9          EQU  H'0001'
FIFOUA10         EQU  H'0002'
FIFOUA11         EQU  H'0003'
FIFOUA12         EQU  H'0004'
FIFOUA13         EQU  H'0005'
FIFOUA14         EQU  H'0006'
FIFOUA15         EQU  H'0007'


;----- C1FIFOUA1U Bits -----------------------------------------------------
FIFOUA16         EQU  H'0000'
FIFOUA17         EQU  H'0001'
FIFOUA18         EQU  H'0002'
FIFOUA19         EQU  H'0003'
FIFOUA20         EQU  H'0004'
FIFOUA21         EQU  H'0005'
FIFOUA22         EQU  H'0006'
FIFOUA23         EQU  H'0007'


;----- C1FIFOUA1T Bits -----------------------------------------------------
FIFOUA24         EQU  H'0000'
FIFOUA25         EQU  H'0001'
FIFOUA26         EQU  H'0002'
FIFOUA27         EQU  H'0003'
FIFOUA28         EQU  H'0004'
FIFOUA29         EQU  H'0005'
FIFOUA30         EQU  H'0006'
FIFOUA31         EQU  H'0007'


;----- C1FLTCON1L Bits -----------------------------------------------------
FLTEN4           EQU  H'0007'
F4BP0            EQU  H'0000'
F4BP1            EQU  H'0001'
F4BP2            EQU  H'0002'
F4BP3            EQU  H'0003'
F4BP4            EQU  H'0004'


;----- C1FLTCON1H Bits -----------------------------------------------------
FLTEN5           EQU  H'0007'
F5BP0            EQU  H'0000'
F5BP1            EQU  H'0001'
F5BP2            EQU  H'0002'
F5BP3            EQU  H'0003'
F5BP4            EQU  H'0004'


;----- C1FLTCON1U Bits -----------------------------------------------------
FLTEN6           EQU  H'0007'
F6BP0            EQU  H'0000'
F6BP1            EQU  H'0001'
F6BP2            EQU  H'0002'
F6BP3            EQU  H'0003'
F6BP4            EQU  H'0004'


;----- C1FLTCON1T Bits -----------------------------------------------------
FLTEN7           EQU  H'0007'
F7BP0            EQU  H'0000'
F7BP1            EQU  H'0001'
F7BP2            EQU  H'0002'
F7BP3            EQU  H'0003'
F7BP4            EQU  H'0004'


;----- C1FLTOBJ1 Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
SID3             EQU  H'0003'
SID4             EQU  H'0004'
SID5             EQU  H'0005'
SID6             EQU  H'0006'
SID7             EQU  H'0007'


;----- C1FLTOBJ1H Bits -----------------------------------------------------
SID8             EQU  H'0000'
SID9             EQU  H'0001'
SID10            EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'


;----- C1FLTOBJ1U Bits -----------------------------------------------------
EID5             EQU  H'0000'
EID6             EQU  H'0001'
EID7             EQU  H'0002'
EID8             EQU  H'0003'
EID9             EQU  H'0004'
EID10            EQU  H'0005'
EID11            EQU  H'0006'
EID12            EQU  H'0007'


;----- C1FLTOBJ1T Bits -----------------------------------------------------
SID11            EQU  H'0005'
EXIDE            EQU  H'0006'
EID13            EQU  H'0000'
EID14            EQU  H'0001'
EID15            EQU  H'0002'
EID16            EQU  H'0003'
EID17            EQU  H'0004'


;----- C1MASK1 Bits -----------------------------------------------------
MSID0            EQU  H'0000'
MSID1            EQU  H'0001'
MSID2            EQU  H'0002'
MSID3            EQU  H'0003'
MSID4            EQU  H'0004'
MSID5            EQU  H'0005'
MSID6            EQU  H'0006'
MSID7            EQU  H'0007'


;----- C1MASK1H Bits -----------------------------------------------------
MSID8            EQU  H'0000'
MSID9            EQU  H'0001'
MSID10           EQU  H'0002'
MEID0            EQU  H'0003'
MEID1            EQU  H'0004'
MEID2            EQU  H'0005'
MEID3            EQU  H'0006'
MEID4            EQU  H'0007'


;----- C1MASK1U Bits -----------------------------------------------------
MEID5            EQU  H'0000'
MEID6            EQU  H'0001'
MEID7            EQU  H'0002'
MEID8            EQU  H'0003'
MEID9            EQU  H'0004'
MEID10           EQU  H'0005'
MEID11           EQU  H'0006'
MEID12           EQU  H'0007'


;----- C1MASK1T Bits -----------------------------------------------------
MSID11           EQU  H'0005'
MIDE             EQU  H'0006'
MEID13           EQU  H'0000'
MEID14           EQU  H'0001'
MEID15           EQU  H'0002'
MEID16           EQU  H'0003'
MEID17           EQU  H'0004'


