GreatCowBASIC/DATFileGenerator/incfiles/p18F26Q84.inc
;----- C1MASK3U Bits -----------------------------------------------------
MEID5            EQU  H'0000'
MEID6            EQU  H'0001'
MEID7            EQU  H'0002'
MEID8            EQU  H'0003'
MEID9            EQU  H'0004'
MEID10           EQU  H'0005'
MEID11           EQU  H'0006'
MEID12           EQU  H'0007'


;----- C1MASK3T Bits -----------------------------------------------------
MSID11           EQU  H'0005'
MIDE             EQU  H'0006'
MEID13           EQU  H'0000'
MEID14           EQU  H'0001'
MEID15           EQU  H'0002'
MEID16           EQU  H'0003'
MEID17           EQU  H'0004'


;----- C1FLTOBJ4 Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
SID3             EQU  H'0003'
SID4             EQU  H'0004'
SID5             EQU  H'0005'
SID6             EQU  H'0006'
SID7             EQU  H'0007'


;----- C1FLTOBJ4H Bits -----------------------------------------------------
SID8             EQU  H'0000'
SID9             EQU  H'0001'
SID10            EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'


;----- C1FLTOBJ4U Bits -----------------------------------------------------
EID5             EQU  H'0000'
EID6             EQU  H'0001'
EID7             EQU  H'0002'
EID8             EQU  H'0003'
EID9             EQU  H'0004'
EID10            EQU  H'0005'
EID11            EQU  H'0006'
EID12            EQU  H'0007'


;----- C1FLTOBJ4T Bits -----------------------------------------------------
SID11            EQU  H'0005'
EXIDE            EQU  H'0006'
EID13            EQU  H'0000'
EID14            EQU  H'0001'
EID15            EQU  H'0002'
EID16            EQU  H'0003'
EID17            EQU  H'0004'


;----- C1MASK4 Bits -----------------------------------------------------
MSID0            EQU  H'0000'
MSID1            EQU  H'0001'
MSID2            EQU  H'0002'
MSID3            EQU  H'0003'
MSID4            EQU  H'0004'
MSID5            EQU  H'0005'
MSID6            EQU  H'0006'
MSID7            EQU  H'0007'


;----- C1MASK4H Bits -----------------------------------------------------
MSID8            EQU  H'0000'
MSID9            EQU  H'0001'
MSID10           EQU  H'0002'
MEID0            EQU  H'0003'
MEID1            EQU  H'0004'
MEID2            EQU  H'0005'
MEID3            EQU  H'0006'
MEID4            EQU  H'0007'


;----- C1MASK4U Bits -----------------------------------------------------
MEID5            EQU  H'0000'
MEID6            EQU  H'0001'
MEID7            EQU  H'0002'
MEID8            EQU  H'0003'
MEID9            EQU  H'0004'
MEID10           EQU  H'0005'
MEID11           EQU  H'0006'
MEID12           EQU  H'0007'


;----- C1MASK4T Bits -----------------------------------------------------
MSID11           EQU  H'0005'
MIDE             EQU  H'0006'
MEID13           EQU  H'0000'
MEID14           EQU  H'0001'
MEID15           EQU  H'0002'
MEID16           EQU  H'0003'
MEID17           EQU  H'0004'


;----- C1FLTOBJ5 Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
SID3             EQU  H'0003'
SID4             EQU  H'0004'
SID5             EQU  H'0005'
SID6             EQU  H'0006'
SID7             EQU  H'0007'


;----- C1FLTOBJ5H Bits -----------------------------------------------------
SID8             EQU  H'0000'
SID9             EQU  H'0001'
SID10            EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'


;----- C1FLTOBJ5U Bits -----------------------------------------------------
EID5             EQU  H'0000'
EID6             EQU  H'0001'
EID7             EQU  H'0002'
EID8             EQU  H'0003'
EID9             EQU  H'0004'
EID10            EQU  H'0005'
EID11            EQU  H'0006'
EID12            EQU  H'0007'


;----- C1FLTOBJ5T Bits -----------------------------------------------------
SID11            EQU  H'0005'
EXIDE            EQU  H'0006'
EID13            EQU  H'0000'
EID14            EQU  H'0001'
EID15            EQU  H'0002'
EID16            EQU  H'0003'
EID17            EQU  H'0004'


;----- C1MASK5 Bits -----------------------------------------------------
MSID0            EQU  H'0000'
MSID1            EQU  H'0001'
MSID2            EQU  H'0002'
MSID3            EQU  H'0003'
MSID4            EQU  H'0004'
MSID5            EQU  H'0005'
MSID6            EQU  H'0006'
MSID7            EQU  H'0007'


;----- C1MASK5H Bits -----------------------------------------------------
MSID8            EQU  H'0000'
MSID9            EQU  H'0001'
MSID10           EQU  H'0002'
MEID0            EQU  H'0003'
MEID1            EQU  H'0004'
MEID2            EQU  H'0005'
MEID3            EQU  H'0006'
MEID4            EQU  H'0007'


;----- C1MASK5U Bits -----------------------------------------------------
MEID5            EQU  H'0000'
MEID6            EQU  H'0001'
MEID7            EQU  H'0002'
MEID8            EQU  H'0003'
MEID9            EQU  H'0004'
MEID10           EQU  H'0005'
MEID11           EQU  H'0006'
MEID12           EQU  H'0007'


;----- C1MASK5T Bits -----------------------------------------------------
MSID11           EQU  H'0005'
MIDE             EQU  H'0006'
MEID13           EQU  H'0000'
MEID14           EQU  H'0001'
MEID15           EQU  H'0002'
MEID16           EQU  H'0003'
MEID17           EQU  H'0004'


;----- C1FLTOBJ6 Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
SID3             EQU  H'0003'
SID4             EQU  H'0004'
SID5             EQU  H'0005'
SID6             EQU  H'0006'
SID7             EQU  H'0007'


