GreatCowBASIC/DATFileGenerator/incfiles/p18F26Q84.inc
;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC2           EQU  H'0002'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- TRISE Bits -----------------------------------------------------
TRISE3           EQU  H'0003'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE3              EQU  H'0003'


;----- INTCON0 Bits -----------------------------------------------------
INT0EDG          EQU  H'0000'
INT1EDG          EQU  H'0001'
INT2EDG          EQU  H'0002'
IPEN_INTCON0     EQU  H'0005'
GIEL             EQU  H'0006'
GIE              EQU  H'0007'
GIEH             EQU  H'0007'


;----- INTCON1 Bits -----------------------------------------------------
STAT0_INTCON1    EQU  H'0006'
STAT1_INTCON1    EQU  H'0007'


;----- STATUS Bits -----------------------------------------------------
NOT_PD           EQU  H'0005'
NOT_TO           EQU  H'0006'
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV_STATUS        EQU  H'0003'
N                EQU  H'0004'
NPD              EQU  H'0005'
NTO              EQU  H'0006'
PD               EQU  H'0005'
TO               EQU  H'0006'


;----- PCON0 Bits -----------------------------------------------------
NOT_BOR          EQU  H'0000'
NOT_POR          EQU  H'0001'
NOT_RI           EQU  H'0002'
NOT_RMCLR        EQU  H'0003'
NOT_RWDT         EQU  H'0004'
NOT_WDTWV        EQU  H'0005'
NBOR             EQU  H'0000'
NPOR             EQU  H'0001'
NRI              EQU  H'0002'
NRMCLR           EQU  H'0003'
NRWDT            EQU  H'0004'
NWDTWV           EQU  H'0005'
STKUNF           EQU  H'0006'
STKOVF           EQU  H'0007'
BOR              EQU  H'0000'
POR              EQU  H'0001'
RI               EQU  H'0002'
RMCLR            EQU  H'0003'
RWDT             EQU  H'0004'
WDTWV            EQU  H'0005'


;----- PCON1 Bits -----------------------------------------------------
NOT_MEMV         EQU  H'0001'
NMEMV            EQU  H'0001'
MEMV             EQU  H'0001'


;----- CPUDOZE Bits -----------------------------------------------------
DOE              EQU  H'0004'
ROI              EQU  H'0005'
DOZEN            EQU  H'0006'
IDLEN            EQU  H'0007'
DOZE0            EQU  H'0000'
DOZE1            EQU  H'0001'
DOZE2            EQU  H'0002'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'
STKPTR5          EQU  H'0005'
SP0              EQU  H'0000'
SP1              EQU  H'0001'
SP2              EQU  H'0002'
SP3              EQU  H'0003'
SP4              EQU  H'0004'
SP5              EQU  H'0005'

;==========================================================================
;
;       RAM Definitions
;
;==========================================================================

       __MAXRAM  H'23FF'
       __BADRAM  H'0000'-H'0037'
       __BADRAM  H'003B'-H'003F'
       __BADRAM  H'004E'-H'0060'
       __BADRAM  H'0069'
       __BADRAM  H'009A'-H'00AB'
       __BADRAM  H'00C0'-H'00D3'
       __BADRAM  H'00E0'-H'00E7'
       __BADRAM  H'0219'-H'023C'
       __BADRAM  H'0252'
       __BADRAM  H'027C'-H'0285'
       __BADRAM  H'02A0'
       __BADRAM  H'02C8'
       __BADRAM  H'02CA'
       __BADRAM  H'02EB'
       __BADRAM  H'02EE'
       __BADRAM  H'02EE'
       __BADRAM  H'02F0'
       __BADRAM  H'0312'-H'0317'
       __BADRAM  H'034E'-H'034F'
       __BADRAM  H'0372'
       __BADRAM  H'0384'-H'0386'
       __BADRAM  H'0391'-H'0392'
       __BADRAM  H'039E'-H'03BB'
       __BADRAM  H'03EE'
       __BADRAM  H'0418'-H'041F'
       __BADRAM  H'0420'
       __BADRAM  H'0422'
       __BADRAM  H'0423'
       __BADRAM  H'0428'-H'043F'
       __BADRAM  H'04C1'-H'04C5'
       __BADRAM  H'04C9'
       __BADRAM  H'04CB'-H'04CD'
       __BADRAM  H'04E1'
       __BADRAM  H'04E3'-H'04E5'


;==========================================================================
; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1      EQU  H'300000'
_CONFIG2      EQU  H'300001'
_CONFIG3      EQU  H'300002'
_CONFIG4      EQU  H'300003'
_CONFIG5      EQU  H'300004'
_CONFIG6      EQU  H'300005'
_CONFIG7      EQU  H'300006'
_CONFIG8      EQU  H'300007'
_CONFIG9      EQU  H'300008'
_CONFIG10     EQU  H'300009'
_CONFIG11     EQU  H'30000A'
_CONFIG12     EQU  H'30000B'
_CONFIG13     EQU  H'30000C'
_CONFIG14     EQU  H'30000D'
_CONFIG15     EQU  H'30000E'
_CONFIG16     EQU  H'30000F'
_CONFIG17     EQU  H'300010'
_CONFIG18     EQU  H'300011'
_CONFIG19     EQU  H'300012'
_CONFIG20     EQU  H'300013'
_CONFIG21     EQU  H'300014'
_CONFIG22     EQU  H'300015'
_CONFIG23     EQU  H'300016'
_CONFIG24     EQU  H'300017'
_CONFIG25     EQU  H'300018'
_CONFIG26     EQU  H'300019'
_CONFIG27     EQU  H'30001A'
_CONFIG28     EQU  H'30001B'
_CONFIG29     EQU  H'30001C'
_CONFIG30     EQU  H'30001D'
_CONFIG31     EQU  H'30001E'
_CONFIG32     EQU  H'30001F'
_CONFIG33     EQU  H'300020'
_CONFIG34     EQU  H'300021'
_CONFIG35     EQU  H'300022'

;----- CONFIG1 Options --------------------------------------------------
_FEXTOSC_LP_1        EQU  H'F8'; LP (crystal oscillator) optimized for 32.768 kHz
_FEXTOSC_XT_1        EQU  H'F9'; XT (crystal oscillator) above 100 kHz, below 8 MHz
_FEXTOSC_HS_1        EQU  H'FA'; HS (crystal oscillator) above 8 MHz
_FEXTOSC_OFF_1       EQU  H'FC'; Oscillator not enabled
_FEXTOSC_ECL_1       EQU  H'FD'; EC (external clock) below 100 kHz
_FEXTOSC_ECM_1       EQU  H'FE'; EC (external clock) for 500 kHz to 8 MHz
_FEXTOSC_ECH_1       EQU  H'FF'; EC (external clock) above 8 MHz
_RSTOSC_HFINTOSC_64MHZ_1 EQU  H'8F'; HFINTOSC with HFFRQ = 64 MHz and CDIV = 1:1
_RSTOSC_EXTOSC_4PLL_1 EQU  H'AF'; EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits
_RSTOSC_SOSC_1       EQU  H'CF'; Secondary Oscillator
_RSTOSC_LFINTOSC_1   EQU  H'DF'; Low-Frequency Oscillator
_RSTOSC_HFINTOSC_1MHZ_1 EQU  H'EF'; HFINTOSC with HFFRQ = 4 MHz and CDIV = 4:1
_RSTOSC_EXTOSC_1     EQU  H'FF'; EXTOSC operating per FEXTOSC bits (device manufacturing default)

;----- CONFIG2 Options --------------------------------------------------
_CLKOUTEN_OFF_2      EQU  H'FF'; CLKOUT function is disabled
_CLKOUTEN_ON_2       EQU  H'FE'; CLKOUT function is enabled
_PR1WAY_ON_2         EQU  H'FF'; PRLOCKED bit can be cleared and set only once
_PR1WAY_OFF_2        EQU  H'FD'; PRLOCKED bit can be set and cleared repeatedly
_CSWEN_OFF_2         EQU  H'F7'; The NOSC and NDIV bits cannot be changed by user software
_CSWEN_ON_2          EQU  H'FF'; Writing to NOSC and NDIV is allowed
_JTAGEN_ON_2         EQU  H'FF'; Enable JTAG Boundary Scan mode and pins
_JTAGEN_OFF_2        EQU  H'EF'; Disable JTAG Boundary Scan mode, JTAG pins revert to user functions
_FCMEN_OFF_2         EQU  H'DF'; Fail-Safe Clock Monitor disabled
_FCMEN_ON_2          EQU  H'FF'; Fail-Safe Clock Monitor enabled
_FCMENP_OFF_2        EQU  H'BF'; FSCM timer will not set FSCMP bit or OSFIF interrupt on Primary XTAL failure
_FCMENP_ON_2         EQU  H'FF'; FSCM timer will set FSCMP bit and OSFIF interrupt on Primary XTAL failure
_FCMENS_OFF_2        EQU  H'7F'; FSCM timer will not set FSCMS bit or OSFIF interrupt on Secondary XTAL failure
_FCMENS_ON_2         EQU  H'FF'; FSCM timer will set FSCMS bit and OSFIF interrupt on Secondary XTAL failure

;----- CONFIG3 Options --------------------------------------------------
_MCLRE_EXTMCLR_3     EQU  H'FF'; If LVP = 0, MCLR pin is MCLR; If LVP = 1, RE3 pin function is MCLR
_MCLRE_INTMCLR_3     EQU  H'FE'; If LVP = 0, MCLR pin function is port defined function; If LVP =1, RE3 pin fuction is MCLR
_PWRTS_PWRT_OFF_3    EQU  H'FF'; PWRT is disabled
_PWRTS_PWRT_64_3     EQU  H'FD'; PWRT set at 64ms
_PWRTS_PWRT_16_3     EQU  H'FB'; PWRT set at 16ms
_PWRTS_PWRT_1_3      EQU  H'F9'; PWRT set at 1ms
_MVECEN_ON_3         EQU  H'FF'; Multi-vector enabled, Vector table used for interrupts
_MVECEN_OFF_3        EQU  H'F7'; Interrupt contoller does not use vector table to prioritze interrupts
_IVT1WAY_ON_3        EQU  H'FF'; IVTLOCKED bit can be cleared and set only once
_IVT1WAY_OFF_3       EQU  H'EF'; IVTLOCKED bit can be cleared and set repeatedly
_LPBOREN_OFF_3       EQU  H'FF'; Low-Power BOR disabled
_LPBOREN_ON_3        EQU  H'DF'; Low-Power BOR enabled
_BOREN_SBORDIS_3     EQU  H'FF'; Brown-out Reset enabled , SBOREN bit is ignored
_BOREN_NOSLP_3       EQU  H'BF'; Brown-out Reset enabled while running, disabled in Sleep; SBOREN is ignored
_BOREN_ON_3          EQU  H'7F'; Brown-out Reset enabled according to SBOREN
_BOREN_OFF_3         EQU  H'3F'; Brown-out Reset disabled

